/* -------------------------------------------------------------------------- */
/*                                  ascii.ahk                                 */
/* -------------------------------------------------------------------------- */
/*                            Author: Archie Adams                            */
/* -------------------------------------------------------------------------- */
/*                         Expansions for ascii art.                          */
/* -------------------------------------------------------------------------- */
*/

; MAYBE: Make UI showing all and commands. Show via |ui
; MAYBE: Add multiline ascii art.

:*:$%::£

::|shr::¯\_(ツ)_/¯
::|shr2::¯\_( ͡° ͜ʖ ͡°)_/¯

::|hap::•ᴗ•
::|hap2::ʘ‿ʘ
::|hap3::(¬‿¬)
::|hap4::(👁 ͜ʖ👁)
::|hap5::( ͡° ͜ʖ ͡°)

::|angry::(•̀o•́)ง
::|angry2::(◣_◢)

::|hmm::(⊙_☉)
::|huh::(⊙_☉)

::|cry::(╥_╥)
::|cry2::.·´¯`(>▂<)´¯`·.

::|confused::(☉_☉)
::|confused2::(●__●)
::|confused3::(⊙.⊙)
::|confused4::ಠ▃ಠ

::|blank::( •_•)
::|glasses::(⌐■_■)
::|tash::( ˇ෴ˇ )

::|worried::(◍•﹏•)
::|terrified::ヽ(ﾟДﾟ)ﾉ

::|shocked::(ʘᗝʘ)

::|wink::( ͡~ ͜ʖ ͡°)

::|kiss::( ˘ ³˘)♥

::|flip::(╯°□°)╯︵ ┻━┻ 

::|flame::♨_♨

::|highfive::(ｏ・_・)ノ”(ᴗ_ ᴗ。)